app/controllers/extensions_controller.rb

INSERT INTO "extensions" ("number", "phone_number_id", "forward_to", "created_at", "updated_at", "user_id") VALUES(1, 1, '', '2010-06-01 00:35:14', '2010-06-01 00:35:14', 1)
---
  def create
    @organization = current_user.organization
    num = @organization.phone_number.next_extension
    @extension = @organization.phone_number.extensions.build(:forward_to =>params[:extension][:forward_to])
    @extension.number = num
    @extension.user = current_user

    respond_to do |format|
      if @extension.save