app/controllers/extensions_controller.rb

SELECT * FROM "extensions" WHERE ("extensions"."id" = 2 AND ("extensions".phone_number_id = 1))
SELECT * FROM "organizations" WHERE ("organizations"."id" = 1)
SELECT * FROM "phone_numbers" WHERE ("phone_numbers".organization_id = 1) LIMIT 1
---
  def show
    @organization = current_user.organization
    @extension = @organization.phone_number.extensions.find(params[:id])

SELECT * FROM "extensions" WHERE ("extensions"."id" = 2 AND ("extensions".phone_number_id = 1))
SELECT * FROM "organizations" WHERE ("organizations"."id" = 1)
SELECT * FROM "phone_numbers" WHERE ("phone_numbers".organization_id = 1) LIMIT 1
---
  def edit
    @organization = current_user.organization
    @extension = @organization.phone_number.extensions.find(params[:id])

SELECT "extensions".id FROM "extensions" WHERE ("extensions"."number" = '3' AND "extensions".phone_number_id = 1 AND "extensions".id <> 2) LIMIT 1
SELECT * FROM "organizations" WHERE ("organizations"."id" = 1)
SELECT * FROM "phone_numbers" WHERE ("phone_numbers".organization_id = 1) LIMIT 1
UPDATE "extensions" SET "updated_at" = '2010-05-26 21:31:38', "forward_to" = '123' WHERE "id" = 2
---
  def update
    @organization = current_user.organization
    @extension = @organization.phone_number.extensions.find(params[:id])

    respond_to do |format|
      if @extension.update_attributes(params[:extension])