app/controllers/invitations_controller.rb

  def create
    @organization = current_user.organization
    @invitation = Invitation.new(params[:invitation])
    @invitation.organization = @organization
    respond_to do |format|
      if @invitation.save
---
INSERT INTO "invitations" ("created_at", "updated_at", "organization_id", "expired", "email") VALUES('2010-05-26 23:21:32', '2010-05-26 23:21:32', NULL, NULL, 'jessica@jessica-and-steve.com')