app/controllers/organizations_controller.rb

SELECT * FROM "organizations"
---
  def index
    @organizations = Organization.all

SELECT * FROM "organizations" WHERE ("organizations"."id" = 1)
---
  def edit
    @organization = Organization.find(params[:id])

INSERT INTO "organizations" ("name", "created_at", "updated_at", "domain", "enabled") VALUES('test Domain', '2010-05-26 05:44:48', '2010-05-26 05:44:48', '', NULL)
INSERT INTO "users" ("name", "salt", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "remember_token", "login", "organization_id", "openid", "email") VALUES('Joe Admin', '3e9b16173b3242dc632af3e2c3de1579d9cb0b04', '2010-06-08 16:22:38', NULL, '9d1996a3e9f42ce29e3dd8b438de9fdce7c719ba', NULL, '2010-06-08 16:22:38', '742707a0b8f1bfd69ad52f6517d796707a5a3bbf', NULL, 'admin@smart-lawfirm.com', NULL, NULL, 'admin@smart-lawfirm.com')
---
  def create
    @organization = Organization.new(params[:organization])
    @organization.from_marketplace = session[:marketplace].present?
    @organization.users << current_user

SELECT * FROM "organizations" WHERE ("organizations"."id" = 1)
---
  def update
    @organization = Organization.find(params[:id])