app/controllers/organizations_controller.rb

SELECT * FROM "organizations" WHERE ("organizations"."id" = 1)
---
  def show
    @organization = Organization.find(params[:id])

INSERT INTO "organizations" ("name", "from_marketplace", "created_at", "updated_at", "domain", "enabled") VALUES('test Domain', NULL, '2010-06-01 00:35:12', '2010-06-01 00:35:12', '', NULL)
---
  def create
    @organization = Organization.new(params[:organization])
    @organization.from_marketplace = session[:marketplace].present?
    @organization.users << current_user