app/controllers/sessions_controller.rb

UPDATE "users" SET "updated_at" = '2010-06-01 01:45:00', "openid" = 'https://www.google.com/accounts/o8/id?id=AItOawlfbvliM9E8SLvMpHw9o1Tk2usoN1uQxy8' WHERE "id" = 1
---
  def associate
    if request.post?
      user = User.authenticate(session[:email], params[:password])
      if user
        user.openid = session[:openid]
        user.save!

SELECT * FROM "users" WHERE ("users"."openid" IS NULL) LIMIT 1
SELECT * FROM "users" WHERE (email = 'steve@jessica-and-steve.com' and activated_at IS NOT NULL) LIMIT 1
SELECT * FROM "users" WHERE (login = 'test' and activated_at IS NOT NULL) LIMIT 1
INSERT INTO "users" ("name", "salt", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "last_contact_sync", "remember_token", "login", "organization_id", "openid", "email") VALUES('Steven Bazyl', '27161150c99de25c858c7bf3addc665b28ea79e1', '2010-05-28 18:44:02', NULL, 'a190e6e7d00bc9fd3f7ecd9b14ec5a2dc9dd4f51', NULL, '2010-05-28 18:44:02', 'b57d00a86e253c83a32f5f06bfadb515174cab3f', NULL, NULL, 'steve@crapalog.com', NULL, 'http://crapalog.com/openid?id=107368009284755511794', 'steve@crapalog.com')
---
  def find_or_create_user(display_identifier, email, first_name, last_name, verified_email)
    user = User.find_by_openid(display_identifier)
    if user.nil?
      user = User.find_by_email(email)
      if user.present?
        if verified_email
          user.openid = display_identifier
          user.save!
        else
          session[:openid] = display_identifier.to_s
          session[:email] = email
          render :action=>'associate'
          return
        end
      else
        user = User.new
        user.name = "Unknown"
        user.name = "#{first_name} #{last_name}" unless first_name.nil? && last_name.nil?
        user.login = email
        user.email = email
        user.password = user.password_confirmation = User.make_token
        user.openid = display_identifier
        user.save!