app/controllers/sessions_controller.rb

SELECT * FROM "users" WHERE ("users"."openid" = 'https://www.google.com/accounts/o8/id?id=AItOawlfbvliM9E8SLvMpHw9o1Tk2usoN1uQxy8') LIMIT 1
SELECT "users".id FROM "users" WHERE ("users"."email" = 'sqrrrl@gmail.com') LIMIT 1
UPDATE "users" SET "updated_at" = '2010-06-01 00:34:50', "activated_at" = '2010-06-01 00:34:50', "activation_code" = NULL WHERE "id" = 1
INSERT INTO "users" ("name", "salt", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "remember_token", "login", "organization_id", "openid", "email") VALUES('Steven Bazyl', '11517d249dc60c6aa7b551aa3013504c6a0d5d55', '2010-06-01 00:34:50', NULL, 'dc18d3b87f9e5eab714fc36151b080e8870420a0', NULL, '2010-06-01 00:34:50', '624ca3648c5c9f5be4e503bf07888aa3b67cc212', NULL, 'sqrrrl@gmail.com', NULL, 'https://www.google.com/accounts/o8/id?id=AItOawlfbvliM9E8SLvMpHw9o1Tk2usoN1uQxy8', 'sqrrrl@gmail.com')
---
  def find_or_create_user(display_identifier, email, first_name, last_name, verified_email)
    user = User.find_by_openid(display_identifier)
    if user.nil?
      user = User.find_by_email(email)
      if user.present?
        if verified_email
          user.openid = display_identifier
          user.save!
        else
          session[:openid] = display_identifier.to_s
          session[:email] = email
          render :action=>'associate'
          return
        end
      else
        user = User.new
        user.name = "Unknown"
        user.name = "#{first_name} #{last_name}" unless first_name.nil? && last_name.nil?
        user.login = email
        user.email = email
        user.password = user.password_confirmation = User.make_token
        user.openid = display_identifier
        user.save!