app/controllers/twilio_controller.rb

  def extension
    #TODO - Validate extension
    @response = Twilio::Response.new
    @extension = @phone.extensions.find_by_number(params[:Digits])
---
SELECT * FROM "extensions" WHERE ("extensions"."number" = '1') AND ("extensions".phone_number_id = 1) LIMIT 1

  def record
    @extension = @phone.extensions.find_by_number(params[:extension])
    message = @extension.messages.build(:guid => params[:CallGuid], :from => "+1#{params[:Caller]}",
      :url => params[:RecordingUrl], :duration => params[:Duration])
    message.save!
---
SELECT * FROM "extensions" WHERE ("extensions"."number" = '3') AND ("extensions".phone_number_id = 1) LIMIT 1
INSERT INTO "messages" ("duration", "created_at", "guid", "from", "updated_at", "url", "extension_id") VALUES(30, '2010-05-27 03:28:38', 'abc', '1234567890', '2010-05-27 03:28:38', NULL, 1)