app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "last_contact_sync", "remember_token", "login", "organization_id", "openid", "email") VALUES('Steven Bazyl', '5a0d6d27e5db5049363ed0d0f85585fb8cbbc2a7', '2010-05-28 21:26:11', NULL, '249ab7415146be1f1227569be645ce79f4f06665', NULL, '2010-05-28 21:26:11', '5dd7ee9fefd77c14aed126da39f8597335c16eeb', NULL, NULL, 'steve@jessica-and-steve.com', NULL, NULL, 'steve@jessica-and-steve.com')
SELECT "users".id FROM "users" WHERE ("users"."email" = 'sqrrrl@gmail.com') LIMIT 1
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.login = @user.email

    success = @user && @user.save
    if success && @user.errors.empty?

UPDATE "users" SET "updated_at" = '2010-05-28 02:25:20', "name" = 'foobarx' WHERE "id" = 3
---
  def update
    @user = current_user
    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."activation_code" = '644e79b09e18c7e232f4a5ea6d8a1683ff109c49') LIMIT 1
---
  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?